import { Translations } from '@/features/locales/types.ts';

const uk: Translations = {
  common: {
    dateOfBirth: 'Дата народження',
    avatar: 'Аватар',
    interests: 'Інтереси',
    day: 'День',
    month: 'Місяць',
    year: 'Рік',
    settings: 'Налаштування',
    subscription: 'Підписки',
    email: 'Пошта',
    yourName: "Ваше ім'я",
    alphabetically: 'За алфавітом',
    popularity: 'За популярністю',
    dateAdded: 'За датою',
    name: "Ім'я",
    enabled: 'Увімкнуто',
    disabled: 'Вимкнуто',
    contactUs: 'Зв’язатися з нами',
    noResults: 'Нічого не знайдено',
    error: 'Помилка',
    success: 'Успішно',
    info: 'Інформація',
    warning: 'Увага',
    pinnedWarning: 'Ви досягли максимального ліміту закріплених чатів. Відкріпіть чат або оновіть свій тарифний план',
  },

  tabBar: {
    home: 'Головна',
    chat: 'Чат',
    profile: 'Профіль',
  },

  languages: {
    uk: 'Українська',
    en: 'Англійська',
  },

  actions: {
    apply: 'Застосувати',
    clear: 'Очистити',
    choose: 'Обрати',
    send: 'Відправити',
    delete: 'Видалити',
    cancel: 'Скасувати',
    continue: 'Продовжити',
    logout: 'Вихід',
  },

  bottomWindows: {
    permissionDenied: {
      title: 'Доступ заборонений',
      subtitle: 'Для використання цієї функції, будь ласка, увімкніть доступ до фото у налаштуваннях',
    },
    deleteAccount: {
      title: 'Видалити акаунт',
      subtitle: 'Ви впевнені, що хочете видалити свій акаунт?',
    },
    logout: {
      title: 'Вийти з акаунту',
      subtitle: 'Ви впевнені, що хочете вийти зі свого акаунту?',
    },
    searchFilter: {
      sort: 'Сортування',
      filter: 'Фільтрація',
      tags: 'Теги',
      selected: 'Обрані',
    },
    deleteChat: {
      title_one: 'Видалити чат',
      title_other: 'Видалити чаты',
      subtitle_one: 'Ви впевнені, що хочете видалити цей чат?',
      subtitle_other: 'Ви впевнені, що хочете видалити ці чати?',
    },
  },

  auth: {
    splashText: 'Оберіть\nВашого Агента',
    signInButton: 'Увійти',
    signUpButton: 'Зареєструватися',
    signIn: {
      header: 'Вхід',
      subheader: 'Будь ласка, увійдіть, щоб продовжити',
      belowButton: 'Немає облікового запису? ',
    },
    signUp: {
      header: 'Реєстрація',
      subheader: 'Будь ласка, зареєструйтесь, щоб увійти',
      belowButton: 'Вже маєте обліковий запис? ',
    },
    verify: {
      header: 'Верифікація',
      subheader: 'Будь ласка, введіть код з вашої пошти',
    },
    continueWith: 'Або продовжуйте з',
  },

  onboarding: {
    initialText: 'Відкрий для себе спілкування з різними агентами',
    description: {
      name: "Будь ласка, введіть ваше ім'я",
      dateOfBirth: 'Будь ласка, вкажіть дату народження',
      avatar: 'Завантажте аватар, це опціонально*',
      interests: 'Будь ласка, оберіть 2 теги',
    },
  },

  home: {
    searchInput: 'Пошук агентів за іменем',
  },

  searchInput: {
    placeholder: 'Пошук у чаті за іменем агента',
  },

  settings: {
    notifications: 'Повідомлення',
    about: 'Про застосунок',
    account: 'Акаунт',
    pushNotifications: 'Сповіщення',
    termsOfService: 'Умови обслуговування',
    legalInformation: 'Юридична інформація',
    privacyPolicy: 'Політика конфіденційності',
    protectYourData: 'Як ми захищаємо ваші дані',
    getHelp: 'Отримати допомогу',
    theme: 'Тема',
    changeAppTheme: 'Змінити тему застосунку',
    removeYourAccount: 'Видалити обліковий запис',
    exitFromAcc: 'Завершити сесію в акаунті',
    language: 'Мова',
    changeAppLanguage: 'Змінити мову застосунку',
  },

  theme: {
    system: 'Системна',
    dark: 'Темна',
    light: 'Світла',
  },

  subscription: {
    header: 'Підписки',
    month: '/місяць',
    free: {
      name: 'Безкоштовна',
      pros: [
        'Повністю безкоштовно',
        'Доступ до базового набору Агентів',
        "Спробуйте додаток без жодних зобов'язань",
        'Обмежений, але достатній час сеансу для дослідження',
      ],
      cons: [
        'Щоденний ліміт повідомлень',
        'Містить рекламу',
        'Доступні лише базові Агенти',
        'Можливі затримки в години пік через нижчий пріоритет сервера',
      ],
    },
    basic: {
      name: 'Базова',
      pros: [
        'Доступна ціна, чудово підходить для звичайного користування',
        'Вищий ліміт повідомлень',
        'Доступ до більшої кількості Агентів',
        'Швидші відповіді з пріоритетною обробкою',
      ],
      cons: ['Невеликі обмеження на кількість повідомлень', 'Обмежена налаштування'],
    },
    premium: {
      name: 'Преміум',
      pros: [
        'Необмежена кількість повідомлень та сеансів',
        'Повний доступ до всіх агентів',
        'Найвищий пріоритет запиту',
        'Повний доступ до налаштування',
      ],
    },
  },

  contactUs: {
    header: "Зв'яжіться з нами",
    description: 'Дайте нам деталі вашого запиту, і наша команда зробить все можливе, щоб допомогти вам належним чином',
    placeholder: 'Напишіть повідомлення...',
  },

  search: {
    placeholder: "Пошук агентів за ім'ям...",
  },

  chat: {
    placeholder: 'Напишіть ваше повідомлення...',
    sameDay: '[Сьогодні]',
    nextDay: '[Завтра]',
    lastDay: '[Вчора]',
  },

  validation: {
    name: "Будь ласка, введіть дійсне ім'я",
    email: 'Будь ласка, введіть дійсний імейл',
    empty: "Обов'язкове поле",
  },

  serverResponses: {
    emailOrNameRequired: "Електронна адреса або ім'я недійсні",
    messageRequired: 'Будь ласка, введіть повідомлення!',
    messageSentSuccess: 'Повідомлення успішно надіслано',
    rateLimitedContactUs: 'Запит обмежений, будь ласка, зачекайте {{amount}} секунд',
    serverError: 'Ой, щось пішло не так, спробуйте ще раз пізніше',
    userUpdated: 'Користувача успішно оновлено',
    emailRequired: "Електронна адреса обов'язкова",
    noAvatarUploaded: "Аватар обов'язковий",
    avatarUploaded: 'Аватар успішно завантажено',
    userAlreadyExists: 'Користувач вже існує, будь ласка, увійдіть',
    userNotFound: 'Користувач не знайдено, будь ласка, зареєструйтесь',
    emailOrCodeRequired: 'Будь ласка, введіть дійсну електронну адресу або код',
    codeExpired: 'Код закінчився, увійдіть знову',
    tooManyAttempts: 'Забагато спроб, увійдіть ще раз',
    wrongCode: 'Неправильний код, залишилося спроб: {{amount}}',
    chatIdsRequired: 'Будь ласка, надайте айді чату',
    chatDeleted: 'Чат видалено',
  },
};

export default uk;
